app/controllers/answers_controller.rb

SELECT * FROM "answers"
---
  def index
    @answers = Answer.all

SELECT * FROM "answers" WHERE ("answers"."id" = 1)
---
  def show
    @answer = Answer.find(params[:id])

INSERT INTO "answers" ("question_id", "number", "created_at", "updated_at", "value", "description") VALUES(1, 1, '2010-11-17 16:23:49', '2010-11-17 16:23:49', 5, 'si')
---
  def create
    # @question = Question.find(params[:question_id])
    # @answer = @question.answers.build(params[:answer])
    @answer = Answer.new(params[:answer])
    if @answer.save

SELECT * FROM "answers" WHERE ("answers"."id" = 1)
---
  def edit
    @answer = Answer.find(params[:id])

SELECT * FROM "answers" WHERE ("answers"."id" = 1)
UPDATE "answers" SET "updated_at" = '2010-11-17 16:47:24', "description" = 'si si si el es muy buena gente' WHERE "id" = 1
---
  def update
    @answer = Answer.find(params[:id])
    if @answer.update_attributes(params[:answer])