app/controllers/company_sessions_controller.rb

  def create
    @company_session = CompanySession.new(params[:company_session])
    if @company_session.save
      @current_company = Company.find_by_login(@company_session.login)
---
SELECT * FROM "companies" WHERE (LOWER("companies".login) = 'unete') LIMIT 1