app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT * FROM "companies"

  def show
    @company = Company.find(params[:id])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)

  def create
    @company = Company.new(params[:company])
    if @company.save
---
INSERT INTO "companies" ("name", "created_at", "crypted_password", "nit", "updated_at", "last_survey", "password_salt", "persistence_token", "telephone", "subsector_id", "login", "email") VALUES('une', '2010-11-20 19:48:11', '28a6e1588e0693ba704beb56d156031af65ae5ceab7db51e645621d2c27b71a99dda5e0448422f05d935752f5e9e22e71099885d564f24ee6a2c7014ad29a1da', 1, '2010-11-20 19:48:11', NULL, 'AzM11qcvFnbLkxFpN63u', 'bd8ce8e419afa4f6cef839f0dfd89b16d4bc322e0c599c35c1d13554b6af2793f5e8c397ef6423a361d9a378e6d9d09a4f78810570d0dc2dcf84afcd14293e6c', '1324345', NULL, 'unete', 'une@une.com')

  def edit
    @company = Company.find(params[:id])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 27)

  def update
    @company = Company.find(params[:id])
    if @company.update_attributes(params[:company])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 27)
UPDATE "companies" SET "persistence_token" = '94d503552f638825832947e834af1402effb429df4143045a1a58b335872ff220f16a99c2492e14944128448f125cb560f157567d8a0162fdec5126a5ddab3d7', "updated_at" = '2010-11-20 18:55:06', "password_salt" = '02mR07J01FGyCGniL9f7', "crypted_password" = '43fe3f5048158de6b7a875aa775e8dc5574b5deb2bc05d45ec3fbacbd52e4585c26c38b3ffd34b75ca1d33cddb3f05b0477f7a3a494d7ff1160bc1ea83b34fe5' WHERE "id" = 33

  def destroy
    @company = Company.find(params[:id])
    @company.destroy
    @company.users.destroy
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)
DELETE FROM "companies" WHERE "id" = 1
DELETE FROM "users" WHERE "id" = 8