app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT * FROM "questions"

  def show
    @question = Question.find(params[:id])
    @answers = @question.answers.sort{|a,b| a.number <=> b.number}
    @aspects = Aspect.all
---
SELECT * FROM "questions" WHERE ("questions"."id" = 1)
SELECT * FROM "aspects" ORDER BY aspects.id DESC LIMIT 1

  def create
    @question = Question.new(params[:question])
    if @question.save
---
INSERT INTO "questions" ("number", "created_at", "aspect_id", "updated_at", "survey_id", "description") VALUES(2, '2010-11-20 14:32:06', 2, '2010-11-20 14:32:06', NULL, 'es una buena pregunts')

  def edit
    @question = Question.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 2)

  def update
    @question = Question.find(params[:id])
    if @question.update_attributes(params[:question])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 2)
UPDATE "questions" SET "updated_at" = '2010-11-17 15:55:22', "description" = 'Sera que alberto colabora con la nota del final.' WHERE "id" = 2