app/controllers/subsectors_controller.rb

SELECT * FROM "subsectors"
---
  def index
    @subsectors = Subsector.all

SELECT * FROM "subsectors" WHERE ("subsectors"."id" = 1)
---
  def show
    @subsector = Subsector.find(params[:id])

INSERT INTO "subsectors" ("name", "created_at", "updated_at") VALUES('Subsector', '2010-10-29 00:26:01', '2010-10-29 00:26:01')
---
  def create
    @subsector = Subsector.new(params[:subsector])
    if @subsector.save