app/controllers/surveys_controller.rb

SELECT * FROM "answers" WHERE ("answers".question_id = 5)
SELECT * FROM "questions" WHERE ("questions"."number" = 5) LIMIT 1
---
  def show
    if params[:answer]
      @current_question = Answer.find(params[:answer]).question
      assign_answer
      @question = Question.find_by_number(next_question)