app/controllers/survey_records_controller.rb

SELECT * FROM "survey_records"
---
  def index
    @survey_records = SurveyRecord.all

SELECT * FROM "survey_records" WHERE ("survey_records"."id" = 1)
---
  def show
    @survey_record = SurveyRecord.find(params[:id])

INSERT INTO "survey_records" ("user_id", "answers", "created_at", "updated_at", "comment") VALUES(NULL, NULL, '2010-11-20 19:55:11', '2010-11-20 19:55:11', NULL)
---
                                      :averages => avg_to_save,
                                      :comment => params[:comment],
                                      :survey_id => params[:survey])
    if @survey_record.save