app/controllers/users_controller.rb

  def show
    @user = current_user || User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '7') LIMIT 1

  def new
    @company = Company.find(params[:company_id])
    if @company.users.count >= 5
---
SELECT * FROM "companies" WHERE ("companies"."id" = 30)
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def create
    @company = Company.find(params[:company_id])
    @user = @company.users.build(params[:user])
    @user.nit_company = @company.nit
    if @user.save_without_session_maintenance
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)
INSERT INTO "users" ("name", "created_at", "crypted_password", "updated_at", "username", "nit_company", "password_salt", "last_name", "persistence_token", "company_id", "email") VALUES('daniel', '2010-10-29 00:49:06', '00aeb12a628414103e8decc352866288a237267355ef5710e06352fad58e7d74dd3803a29f910d76f352aa8968315a1d96c61dcdfe60133296e48d3e0109b425', '2010-10-29 00:49:06', 'daniel4', 1, 'b1aUk609cAFaD9GrHfx', 'munera', '8bd9459f338bb68b849cba15aa443e5365e8fb010618ef6bab26fbba2c750c8679581024fd622384732beac30fbe4dfc9777217eaedd9b69644a09c241fdc2b8', NULL, 'ai@a.com')

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users".company_id = 5) LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 20 AND ("users".company_id = 11))
UPDATE "users" SET "persistence_token" = '03745041a12bf882a6c18b244056925669d6ccefb883619d097bc3fea097bf9978c64c21bd6051e06bcb1c13b3c31ce962db4613c779538c351aebfbb6aff8f9', "updated_at" = '2010-10-31 20:45:22', "email" = 'daniel@qc.com', "password_salt" = 'cYRNXHrSrJfVWsBsd', "crypted_password" = '3cff474a6aebed7b79bf27a9c8093cc9d2e9babb52b7fe7563fd205cbef9a8002551f4e7838e613b3b1d18d190f2b191d23d3d64eeb942e98ccaabc118b8051c' WHERE "id" = 20