app/controllers/user_sessions_controller.rb

SELECT * FROM "users" WHERE (LOWER("users".username) = 'dmuneras') LIMIT 1
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      @user = User.find_by_username(@user_session.username)